literate-init.org
# -*- coding: utf-8; -*-
#+PROPERTY: header-args :tangle literate-init.el
#+PROPERTY: header-args+ :comments link
#+PROPERTY: header-args+ :shebang ;; -*- lexical-binding: t-*-

#+TITLE: An Emacs Configuration
#+AUTHOR: Nathanael Schweers

* Workaround for a security bug
#+BEGIN_SRC elisp
  ;; Mitigate Bug#28350 (security) in Emacs 25.2 and earlier.
  (eval-after-load "enriched"
    '(defun enriched-decode-display-prop (start end &optional param)
       (list start end)))
#+END_SRC
* Early setup
Some things just have to happen really early.
** Activate lexical scope
As Emacs started out without lexical scope, it has to be enabled by the
programmer on a per-buffer basis.  The whole file gets a shebang argument via a
property line (see the beginning of the Org file).

** No splash screen
#+BEGIN_SRC elisp
  (setf inhibit-startup-message t)
#+END_SRC

** Don’t load old .elc files
For some reason the default in Emacs is or was to load outdated bytecode files.

#+BEGIN_SRC elisp
  (setf load-prefer-newer t)
#+END_SRC

** Install =use-package= if necessary
At this point we have not yet loaded anything into emacs, hence =use-package= is
not yet loaded, possibly not even installed.  To rectify this situation, as
first we need to set up the packages system.
*** Initialize the package system
    We have to initialize the package system before using it, so we do that here.

    We have to =require= the package system, as it is not loaded by default.

    #+BEGIN_SRC elisp
      (require 'package)
    #+END_SRC
**** Add melpa and melpa-stable repositories
     I use an alist of repositories (currently only two) which are added to the
     package archives unless they are already present.
    #+BEGIN_SRC elisp
      ;; Add melpa to package repos
      (dolist (m '(("melpa-stable" . "http://stable.melpa.org/packages/")
                   ("melpa" . "http://melpa.org/packages/")))
        (add-to-list 'package-archives m t))
    #+END_SRC
**** Add Org Mode repo
     Not only do we want to add the repository, we also want to append it (at
     least that’s what the [[http://orgmode.org/elpa.html][website]] says).

     #+BEGIN_SRC elisp
       (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
     #+END_SRC
*** Initialize
    As soon as the archives have been added, the package system can be initialized.
    As a poor man’s check, I look for a file named after one of the archives.  If it
    doesn’t (yet) exist, the archives have to be fetched.

    #+BEGIN_SRC elisp
      (package-initialize)

      (unless (file-exists-p (expand-file-name
                              "elpa/archives/melpa"
                              user-emacs-directory))
        (package-refresh-contents))
    #+END_SRC

    I used to have a whole lot more code, which can be found in the [[file:code/setup-package.el][original file]].
    I hope this is no longer needed.  I never really liked having it, but is was
    once necessary.
*** Setup =use-package=
    Now that the package system is set up, I can install =use-package=.

    #+BEGIN_SRC elisp
      (unless (package-installed-p 'use-package)
        (package-install 'use-package))
    #+END_SRC

    Last but not least I want =use-package= to automatically install missing
    packages and be verbose about what it’s doing.  As I don’t want to pass an
    extra option to every single invocation, I’ll add it as a default here.

    #+BEGIN_SRC elisp
      (setf use-package-always-ensure t
            use-package-verbose t)
    #+END_SRC
** Add site-lisp to load path
The directory site-lisp is not by default part of the load-path.  Also add mu4e
to the load path explicitly.

#+BEGIN_SRC elisp
  (add-to-list 'load-path (expand-file-name "site-lisp" user-emacs-directory))
  ;; (add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
#+END_SRC

** Add debian specific stuff
If I’m on debian, I want debian-el.  The problem is that its not included in
melpa, so I have to install it via package manager.

I first want to check if I’m on Unix, then if I’m on debian.

#+BEGIN_SRC elisp
  (defun on-unix? ()
    (not (memq system-type '(ms-dos windows-nt))))

  (defun on-debian? ()
    (when (and (on-unix?)
               (file-exists-p "/etc/os-release"))
      (with-temp-buffer
        (insert-file-contents "/etc/os-release")
        (goto-char 1)
        (search-forward-regexp "^ID=")
        (looking-at-p "debian$"))))

#+END_SRC

Now that I can check whether or not I’m on debian, I want to check whether or
not =debian-el= is installed.

#+BEGIN_SRC elisp
  (defun debian-el-installed? ()
    (with-temp-buffer
      (call-process "/usr/bin/aptitude" nil t nil
                    "search" "?installed(^debian-el$)")
      (goto-char (point-min))
      (looking-at-p "^i")))

#+END_SRC

Now that we can check that, we check whether it is installed and then add the
appropriate directory to the load path.

#+BEGIN_SRC elisp
  (when (and (on-debian?)
             (debian-el-installed?))
    (add-to-list 'load-path "/usr/share/emacs/site-lisp/debian-el" t))
#+END_SRC

Now we can finally =require= =debian-el=!

#+BEGIN_SRC elisp
  (when (and (on-debian?)
             (debian-el-installed?))
    (require 'debian-el))
#+END_SRC
* Set up the appearance of Emacs
We set up the appearance very early on so the display doesn’t behave too badly.
Unfortunately it still flickers and bugs around a little.
** Remove the GUI elements we don’t like
First, we remove the toolbar, as no sane person should be using it in Emacs.
Well, no sane person using Emacs a /lot/ should use it.

#+BEGIN_SRC elisp
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
#+END_SRC

#+BEGIN_SRC elisp
  (if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
#+END_SRC

** Highlight parentheses
When point is on a parenthesis, we want to highlight the matching paren.

#+BEGIN_SRC elisp
  (show-paren-mode 1)
#+END_SRC

** Font size
I don’t want a huge font.  As I want to be able to change the font size while
running Emacs, and I want to be able to return to /my/ default size, I record
that in a variable.  Then the variable is used to set the fontsize.

#+BEGIN_SRC elisp
(defvar schweers/default-font-height 80)
(set-face-attribute 'default nil :height schweers/default-font-height)
#+END_SRC
** Global font locking
   :PROPERTIES:
   :header-args: :tangle no
   :END:
Normally, Emacs enables font locking by default.  The code is still here, but it
won’t be tangled.

#+BEGIN_SRC elisp
  (global-font-lock-mode t)
#+END_SRC

** Scrollbar on the right
For some reason the default in Emacs is not to put the scrollbar on the right.
As this only works in window systems, we have to check for that too.

#+BEGIN_SRC elisp
  (when window-system
    (set-scroll-bar-mode 'right))
#+END_SRC

** Line and column numbers
Always show both line /and/ column numbers in the modeline.

#+BEGIN_SRC elisp
  (column-number-mode 1)
  (line-number-mode 1)
#+END_SRC

** Show empty lines after buffer end.
I want to see empty lines at the end of the buffer.

#+BEGIN_SRC elisp
  (set-default 'indicate-empty-lines t)
#+END_SRC

** Mouse support in xterm
When we have a terminal session, but it’s in an xterm, we can still use the
mouse.  But, we have to activate it.

#+BEGIN_SRC elisp
  (xterm-mouse-mode 1)
#+END_SRC

** Maximize the current frame
Unfortunately this doesn’t work terribly well.  I’m not sure if there is a
better way to do this.  I especially would like to not touch the windows system,
as there are too many, and some of them are just plain weird.

#+BEGIN_SRC elisp
  (when window-system
    (set-frame-parameter nil 'fullscreen 'maximized))
#+END_SRC

** Disable cursor blinking
This too also only works when using a window system.  On the other hand, it’s
not needed on a terminal.

#+BEGIN_SRC elisp
  (when window-system
    (blink-cursor-mode -1))
#+END_SRC

** Disable beeping
Don’t ever beep.  I’d rather have a flashing screen.

#+BEGIN_SRC elisp
  (setf visible-bell t)
#+END_SRC

** Set the region color
As my second screen isn’t in a terribly good shape, the default region color is
barely readable.  Normally I’d use customize, but the customize facility thinks
(or used to think) that Emacs is running with -q, even when it isn’t.

#+BEGIN_SRC elisp
  (face-spec-set 'region
                 '((t (:distant-foreground "royal blue"
                                           :background "cornflower blue"))))
#+END_SRC

** Change the threshold for vertical or horizontal split
As I generally prefer putting windows next to each other rather than stacking
them, I changed the threshold.

#+BEGIN_SRC elisp
  (setf split-height-threshold 180)
#+END_SRC
* Set up some more sane defaults
Emacs is full of variables etc. which have defaults which are highly outdated.
This is the reason for the proliferation of so many Emacs starter kits.

While my visual settings may also fall into this category, I wanted to separate
them for technical reasons: I want the visual settings to be activated before
doing the heavy lifting, as much of the loading I do is quite time-consuming.
** Make script files executable on save
If a file starts with #! the file should gain the executable bit.
#+BEGIN_SRC elisp
  (add-hook
   'after-save-hook
   'executable-make-buffer-file-executable-if-script-p)
#+END_SRC
** Cleanup whitespace on save
Any trailing whitespace on a line, or empty lines at the beginning or end of a
buffer should be stripped before saving.
#+BEGIN_SRC elisp
  (add-hook 'before-save-hook #'whitespace-cleanup)
#+END_SRC
** Show trailing whitespace
   :PROPERTIES:
   :header-args: :tangle no
   :END:
Emacs can show trailing whitespace, but I don’t want it to go overboard with it.

#+BEGIN_SRC elisp
  (setf whitespace-style '(face trailing lines indentation indentation::space))
  (global-whitespace-mode 1)
#+END_SRC
*** Disable whitespace mode for Org Mode buffers
Org Mode often shows long text in a shorter fashion (e.g. links) and sometimes
even requires long lines because of its syntax.

Sadly, this does not work.
#+BEGIN_SRC elisp
  (add-hook 'org-mode-hook (lambda () (whitespace-mode -1)) t)
#+END_SRC
** Set a proper place for =custom.el=
By default Emacs still uses the home directory of the user directly.  This is a
quite sad relic of the old days on UNIX.  Nowadays one should put all Emacs
related files into a directory and make said directory a git (or hg, or
whatever) repository.  A consequence of this policy is that Emacs places its
customize settings directly into =user-init-file=.  The variable =custom-file=
holds the place to use.  After setting the place, the file is loaded.

#+BEGIN_SRC elisp
  (setf custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file)
#+END_SRC

Possibly I should stop using customize altogether.

** Place backups at a sane position
Backup files should be written to a separate directory, as to not annoy other
users who may browse the same tree.  This is particularly true of mounted
network shares.  Luckily, the widespread use of version control pretty much
makes this a non-issue.  Still, it may be useful for TRAMP.

The second line makes sure that backup files are even created when Emacs thinks
we’re using version control.  Note that I don’t ever use =vc-mode=, as =magit=
is the best interface to git there ever was, and git can interface with most
other systems, to make them more usable and sane (I’m looking at you SVN)!

#+BEGIN_SRC elisp
  (setf backup-directory-alist
        `(("." . ,(expand-file-name "backups" user-emacs-directory)))
        vc-make-backup-files t)
#+END_SRC

** Save where point is/was in a visited file
Emacs can keep track of where point last was in a file.  The data
needed for this is saved in a file.  The name for this file can be
found in the variable =save-place-file=.  Sadly, debian broke emacs in
stretch, so I have to use this ancient emacs24.5 like some cretin

#+BEGIN_SRC elisp
  (unless (version<= emacs-version "25.0")
    (setf save-place-file (expand-file-name ".places" user-emacs-directory))
    (if (version< emacs-version "25.1")
        (progn
          (require 'saveplace)
          (setq-default save-place t))
      (save-place-mode 1)))
#+END_SRC

** Echo keystrokes
Normally Emacs waites for a while before showing the keys which were pressed, if
the given keys are not sufficient to form a command (i.e. they result in a
keymap).

I want this to happen quickly.

#+BEGIN_SRC elisp
  (setf echo-keystrokes 0.1)
#+END_SRC

** Disable shift-selection
As I use the region the way it’s supposed to be used in Emacs, I don’t need any
shift selection.  Also, it interferes with switching windows using shift with
the arrow keys.  Nevermind that both scenarios are a problem in Org Mode.

#+BEGIN_SRC elisp
  (setf shift-select-mode nil)
#+END_SRC

** Use automatic, transparent compression of files.
Emacs can transparently open compressed files (among other things).  It can also
transparently open encrypted files and archives!  To activate autocompression,
we need to activate a mode.

#+BEGIN_SRC elisp
  (auto-compression-mode 1)
#+END_SRC

** Enable UTF-8 for everything
I’m not entirely sure how this piece of code works, I just scraped it from
Magnar Sveen’s config.

#+BEGIN_SRC elisp
  ;; UTF-8 please
  (setf locale-coding-system 'utf-8)      ;pretty
  (set-terminal-coding-system 'utf-8)     ;pretty
  (set-keyboard-coding-system 'utf-8)     ;pretty
  (set-selection-coding-system 'utf-8)    ;pretty
  (set-language-environment "UTF-8")      ;please
  (prefer-coding-system 'utf-8)           ;with sugar on top
#+END_SRC

** Activate transient mark mode
As any program which is used in the 21st century, Emacs can select text.  Unlike
any other program in this century, it doesn’t do so by default.  At least not in
a way anyone would expect.  To enable this behavior, enable
=transient-mark-mode=.

#+BEGIN_SRC elisp
  (transient-mark-mode 1)
  (make-variable-buffer-local 'transient-mark-mode)
  (put 'transient-mark-mode 'permanent-local t)
  (setq-default transient-mark-mode t)
#+END_SRC

** Delete selected text on backspace or delete
For historic reasons, Emacs does not delete the selected text on backspace or
delete, but deletes one character and disables the region (selection).  To
rectify this, we need another mode.

#+BEGIN_SRC elisp
  (delete-selection-mode 1)
#+END_SRC

** Set the desired line width
Emacs breaks lines at 72 characters, not 80, by default.  This can be changed
with a variable.  Also, there is a global minor mode and a function to do this
as one types.

#+BEGIN_SRC elisp
  (setq-default fill-column 80)
  (setq-default auto-fill-function 'do-auto-fill)
  (auto-fill-mode 1)
#+END_SRC

** Save a list of recent files
Save a list of recently opened files.  This can be accessed via C-x f.  I have
to admit that I have never used this, and helm barfs on buffer history for some
reason.  I’m not sure whether or not this is related.

#+BEGIN_SRC elisp
  (recentf-mode 1)
  (setq recentf-max-saved-items 100) ;; just 20 is too recent
#+END_SRC

** Save minibuffer history
Emacs can also save the history of the minibuffer.  Like, duh!  Again we need a
mode and a variable.

#+BEGIN_SRC elisp
  (savehist-mode 1)
  (setf history-length 1000)
#+END_SRC

** Setup winner mode
I’ve never really gotten around to doing this, but maybe I will some day.  It
seems Emacs can save window configurations and switch between them.  I have no
idea how well this works.  It can be activated by enabling a global minor mode.

#+BEGIN_SRC elisp
  (winner-mode 1)
#+END_SRC

** Never indent tabs
While this tends to break Makefiles, in general one doesn’t want tabs in source
code.  Yes, this is subject to flamewars, but I’ve settled it for myself.

#+BEGIN_SRC elisp
  (set-default 'indent-tabs-mode nil)
#+END_SRC

** Navigate sillycased words with subword mode
Thanks to =global-subword-mode= one can navigate words with weird casing in any
mode!

#+BEGIN_SRC elisp
  (global-subword-mode 1)
#+END_SRC

